{
  "project": [
    {
      "id": 1,
      "name": "Code Helper Blog (php)",
      "description": "This is a simple blog project created using Core PHP, HTML, CSS and Bootstrap. The blog is named 'Code Helper' and is designed to provide useful articles, tutorials and tips for programmers and developers.",
      "image": "https://i.ibb.co/DG0Fhq0/20230422-164433.jpg",
      "url": "https://github.com/Armanidrisi/Code-Helper-Blog"
    },
    {
      "id": 2,
      "name": "PassGen (python)",
      "description": "PassGen is a command line app for termux,kali linux etc. written in Python that generates secure and strong passwords for various accounts and websites. It allows users to customize the length and complexity of the generated passwords.",
      "image": "https://i.ibb.co/yhF3dF1/Smart-Select-20230225-010558-Termux.jpg",
      "url": "https://github.com/Armanidrisi/PassGen"
    },
    {
      "id": 3,
      "name": "ShortLink (python flask)",
      "description": "This is a Short Link Maker App created using Python Flask and SQLite3. The app allows users to create shortened links for long URLs and use them in their projects.",
      "image": "https://i.ibb.co/XpJ8hJb/6443cddc7105585c2735be70.jpg",
      "url": "https://github.com/Armanidrisi/ShortLink-Flask"
    },
    {
      "id": 4,
      "name": "Textutils (React)",
      "description": "TextUtils is a React project designed to provide users with a set of powerful and easy-to-use text manipulation tools. The website aims to help users streamline their writing tasks and make working with text more efficient and convenient.",
      "image": "https://i.ibb.co/WKsNwpY/6443cc6c0f248456d32d75e4.jpg",
      "url": "https://github.com/Armanidrisi/textutils-react"
    },
    {
      "id": 5,
      "name": "DjangoApp (Python Django)",
      "description": "DjangoApp is a Python Django project that allows users to login and signup. This project was created using Django's built-in authentication system and the SQLite3 database and frontend created using tailwindcss.",
      "image": "https://i.ibb.co/X5sy4BB/Smart-Select-20230422-183304-Via.jpg",
      "url": "https://github.com/Armanidrisi/DjangoApp"
    },
    {
      "id": 6,
      "name": "ChatGPT Telegram Bot (Python)",
      "description": "This is a Telegram bot created using Python and OpenAI that uses PyTelegramBotAPI for interacting with Telegram's API. This bot is designed to use OpenAI's GPT-3.5 architecture for generating text-based responses to user queries.",
      "image": "https://i.ibb.co/TBvNhBZ/20230422-171239.jpg",
      "url": "https://github.com/Armanidrisi/chatgpt-python-bot"
    },
    {
      "id": 7,
      "name": "URLShortner (Nodejs)",
      "description": "This is a URL Shortener website created using Node.js Express, MongoDB Mongoose. The app allows users to create shortened links for long URLs and use them in their projects.",
      "image": "https://i.ibb.co/LnkHLG3/6443dd177ab4d5139505175d.jpg",
      "url": "https://github.com/Armanidrisi/UrlShortner"
    }
  ]
}
